music_app/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by_credentials(params[:user][:email], params[:user][:password])

        if @user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "9u1do3HRQOx1LxshXph_2Q"], ["updated_at", "2022-03-15 17:38:51.676195"], ["id", 5]]